Revit 2027 API
ParameterTypeId.ContinuousFootingDefaultEndExtensionLength Property
 "Default End Extension Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousFootingDefaultEndExtensionLength { get; }
Public Shared ReadOnly Property ContinuousFootingDefaultEndExtensionLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousFootingDefaultEndExtensionLength {
	ForgeTypeId^ get ();
}
static member ContinuousFootingDefaultEndExtensionLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace